export const appTitle = {
    title: 'KoraPraktikum'
  }
  
  export const homePageAboutInfo = {
    texts: {
      textFirst:
        'В наши дни огромное количество людей по всему миру начинают все больше интересоваться миром технологий и поддерживать разные IT-компании, например, закупая их продукцию. В следствии чего компании, занимающиеся разработкой программного обеспечения, новых моделей смартфонов, компьютеров, телевизоров и большого количества других устройств, стали гигантами мирового рынка – вспомнить хотя бы Apple, Google, Amazon, Nvidia. Капитализации этих компаний давно превысили десятки миллиардов долларов и возглавляют топы самых крупных и влиятельных компаний планеты.',
      textSecond:
        'Из-за популяризации и резкого роста качества и количества электроники, стало требоваться гораздо больше людей в IT-секторе – в том числе и программистов. Ежедневно появляется огромное количество вакансий в компании в этом секторе, по разным направлениям, будь то разработка игр, создание сайтов, программного обеспечения, драйверов, мобильных приложений, операционных систем и многого, многого другого. За счет потребности в большом количестве программистов, чтобы разрабатывать и поддерживать огромное количество разнообразных продуктов, зарплаты программистов сильно выросли, что послужило дополнительным мотиватором к тому, чтобы люди, прежде не связанные с IT, начали с ещё большим интересом поглядывать на это направление, а некоторые начинали изучать программирование.',
      textThird:
        'Ни для кого не секрет, что существуют разные языки программирования. Они различаются подходом к синтаксису, их возможностям и удобству по решению конкретных проблем. Так, например, на языке программирования С++ можно написать программы, которые будут выполняться крайне быстро, ведь этот язык заточен под то, чтобы у программиста была возможность полностью управлять программой, вплоть до того, чтобы вручную выделять и освобождать память компьютера, которую потребляет программа. Этот язык очень универсален – по сути, на нем можно написать почти какую угодно программу, и она будет работать очень быстро. На этом языке пишется большинство высокобюджетных игр, драйвера, микроконтроллеры,  банковские приложения, back-end некоторых сайтов, программы, связанные со сложными вычислениями и огромное количество другого софта.',
      textFourth:
        'Но С++ считается довольно сложным для изучения языком. Это и не удивительно, ведь для того, чтобы написать какое-нибудь полноценное приложение, нужно знать очень много как о языке, так и о том, как работает компьютер, как должно работать приложение, как оно должно быть написано и очень много других вещей.',
      textFifth:
        'В противовес С++ зачастую ставят Python – высокоуровневый язык программирования, который не отличается высокой скоростью работы, зато предоставляет возможность писать сложные программы в весьма короткие сроки, при этом скорость написания программы с нуля (а значит, и стоимость разработки) становится гораздо привлекательнее как для бизнесов, которым очень хочется как можно быстрее получить готовый продукт, способный начать приносить деньги, так и для обычных программистов, которые хотят реализовать какую-либо свою идею. Да, на Python невозможно написать оптимизированную высокобюджетную игру с современной графикой, но в сфере data-science, машинного обучения (ML), интернет-приложениях у него толком нет конкуренции. Возможно, по этой причине язык Python держится на вершинах популярности, занимая 1-2 места уже который год.',
    }
  }
  